#ifndef _MODE_H_
#define _MODE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// モードクラス
//=============================================================================
class CMode
{
public:
	CMode();
	virtual ~CMode();
	virtual HRESULT Init(void) = 0;
	virtual void Uninit(void) = 0;
	virtual void Update(void) = 0;
	virtual void Draw(void) = 0;
};

#endif